In [1]:
# add pandas
import pandas as pd

# import data
file_schools = "/Volumes/External WD/GWU Data Science/Classwork/GWU_School_District_Analysis/Resources/schools_complete.csv"
file_students = "/Volumes/External WD/GWU Data Science/Classwork/GWU_School_District_Analysis/Resources/students_complete.csv"

schools_df = pd.read_csv(file_schools)
students_df = pd.read_csv(file_students)

In [2]:
# view last 5 rows
students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [3]:
# view first 5 rows
schools_df.tail()

    School ID            school_name      type  size   budget
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [4]:
# determine missing data
schools_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [5]:
# determine missing data
students_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [6]:
# determine missing data
students_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [7]:
schools_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [8]:
schools_df.budget.dtype

dtype('int64')

In [9]:
students_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [10]:
# Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [11]:
# Iterate through the "prefixes_suffixes" list and replace them with "" when it appears in the student's name.
for word in prefixes_suffixes:
    students_df["student_name"] = students_df["student_name"].str.replace(word,'')
# In the first part of loop, we assign each student name in the student_name column 
# with the same student name after we replace the prefix or suffix with an empty string.
# To replace the prefix or suffix with an empty string, we convert the name of the 
# student to a string with student_data_df["student_name"].str. For every word in the 
# prefixes_suffixes list, we replace it, if the name has one, with an empty string using replace(word,"").

/var/folders/pd/b40qs6qn5mzbx_46ghspzwyh0000gn/T/ipykernel_6391/3490859875.py:3: FutureWarning: The default value of regex will change from True to False in a future version.
  students_df["student_name"] = students_df["student_name"].str.replace(word,'')

#### FutureWarning: 
https://stackoverflow.com/questions/66603854/futurewarning-the-default-value-of-regex-will-change-from-true-to-false-in-a-fu

In [12]:
# Combine the data into a single dataset.
complete_school_df = pd.merge(students_df, schools_df, on=["school_name", "school_name"])
complete_school_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [13]:
# total number of students
student_count = complete_school_df["Student ID"].count()
student_count

39170

In [14]:
# total number of schools (option 1)
school_count = schools_df["School ID"].count()
school_count

15

In [15]:
# total number of schools (option 2)
school_count2 = len(complete_school_df["School ID"].unique())
school_count2

15

In [16]:
# total budget
total_budget = schools_df["budget"].sum()
total_budget

24649428

In [17]:
# average reading score
avg_reading = complete_school_df["reading_score"].mean()
avg_reading

81.87784018381414

In [18]:
# average math score
avg_math = complete_school_df["math_score"].mean()
avg_math

78.98537145774827

In [19]:
# passing math (option 1)
passing_math = 0
for score in complete_school_df["math_score"]:
    if score>=70:
        passing_math +=1
passing_math

29370

In [20]:
# passing math (option 2)
passing_math2 = complete_school_df["math_score"]>=70
passing_math2

0         True
1        False
2        False
3        False
4         True
         ...
39165     True
39166     True
39167     True
39168     True
39169     True
Name: math_score, Length: 39170, dtype: bool

In [21]:
# passing math (option 2 - continued)
passing_math2 = complete_school_df[complete_school_df["math_score"]>=70]
passing_math2_count = passing_math2["student_name"].count()
passing_math2_count

29370

In [22]:
# passing reading
passing_reading = 0
for score in complete_school_df["reading_score"]:
    if score>=70:
        passing_reading +=1
passing_reading

33610

In [23]:
# percent passing math
percent_pass_math = passing_math/student_count *100
percent_pass_math

74.9808526933878

In [24]:
# percent passing reading
percent_pass_read = passing_reading/student_count *100
percent_pass_read

85.80546336482001

In [25]:
complete_school_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
School ID         int64
type             object
size              int64
budget            int64
dtype: object

In [26]:
# percent passed both reading and math - not working
#pass_both = 0
#for score in complete_school_df["reading_score"]:
#    for scores in complete_school_df["math_score"]:
#        if (score>=70) & (scores>=70):
#            pass_both +=1
#pass_both

In [27]:
# count of students who passed both
# passing through df again with criteria together
pass_both = complete_school_df[(complete_school_df["math_score"]>=70) & (complete_school_df["reading_score"]>=70)]
pass_both_count = pass_both["student_name"].count()
# other option: WHY DOES THIS WORK? How can we use student_name in the chain?
# pass_both_count = pass_both.student_name.count()
pass_both_count

25528

In [28]:
# percent passing both reading and math
percent_pass_both = pass_both_count / student_count *100
percent_pass_both

65.17232575950983

In [29]:
district_summary_df = pd.DataFrame([{"Total Schools": school_count, "Total Students": student_count,
                    "Total Budget": total_budget, "Average Reading Score": avg_reading, 
                    "Average Math Score": avg_math, "% Passing Reading": percent_pass_read,
                    "% Passing Math": percent_pass_math, "% Overall Pass": percent_pass_both}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Reading Score,Average Math Score,% Passing Reading,% Passing Math,% Overall Pass
0,15,39170,24649428,81.87784,78.985371,85.805463,74.980853,65.172326

In [40]:
# Format the dataframe
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

ValueError: Cannot specify ',' with 's'.

In [ ]:
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

In [41]:
district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:,.1f}".format)
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:,.1f}".format)
district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:,.0f}%".format)
district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:,.0f}%".format)
district_summary_df["% Overall Pass"] = district_summary_df["% Overall Pass"].map("{:,.0f}%".format)

In [42]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Reading Score,Average Math Score,% Passing Reading,% Passing Math,% Overall Pass
0,15,"39,170","$24,649,428.00",81.9,79.0,86%,75%,65%

In [45]:
# Reorder the columns in the order you want them to appear.
new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Pass"]

# Assign district summary df the new column order.
district_summary_df = district_summary_df[new_column_order]

In [46]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Pass
0,15,"39,170","$24,649,428.00",79.0,81.9,75%,86%,65%